# Electrical System Neutral Conductor Size Property

Source: https://www.revitapidocs.com/2026/a74714b3-cdbd-6736-bcbb-315cc17a8b0a.htm

---

| Electrical System Neutral Conductor Size Property |
| --- |

The size of a Neutral Conductor in the Electrical System.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId NeutralConductorSize { get; }
```

```
Public ReadOnly Property NeutralConductorSize As ElementId
	Get
```

```
public:
property ElementId^ NeutralConductorSize {
	ElementId^ get ();
}
```

```
member NeutralConductorSize : ElementId with get
```

#### Property Value

ElementId Exceptions

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

Remarks Each Neutral Conductor has the same size in the Electrical System. See Also

#### Reference

ElectricalSystem Class Autodesk.Revit.DB.Electrical Namespace